Table of Contents
 Class ConcreteULSCheckResultInteractionEc2
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
ULS Check Interaction Ec2
public class ConcreteULSCheckResultInteractionEc2 : ConcreteULSCheckResultInteraction
Inheritance
object
ConcreteCheckResultBase
ConcreteULSCheckResultInteraction
ConcreteULSCheckResultInteractionEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CheckValueShearAndTorsion
Calculated value of the exploitation of the cross-section (for interaction of shear and torsion) related to the limit value
public double CheckValueShearAndTorsion { get; set; }
Property Value
double
 CheckValueShearTorsionAndBending
Calculated value of the exploitation of the cross-section (for interaction of shear, torsion and bending) related to the limit value
public double CheckValueShearTorsionAndBending { get; set; }
Property Value
double
 Medy
Design value of the applied bending moment around y axis
public double Medy { get; set; }
Property Value
double
 Medz
Design value of the applied bending moment around z axis
public double Medz { get; set; }
Property Value
double
 Ned
Design value of the applied axial force
public double Ned { get; set; }
Property Value
double
 Ted
Design value of the applied torsional moment
public double Ted { get; set; }
Property Value
double
 Ved
Design value of the applied shear force
public double Ved { get; set; }
Property Value
double
 Edit this page